In [ ]:

import pandas as pd 

  

data = [['tom', 10], ['nick', 15], ['juli', 14]] 

   

df = pd.DataFrame(data, columns = ['Name', 'Age']) 

  
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [ ]:

import pandas as pd 

  
# initialize data of lists. 

data = {'Name':['Tom', 'nick', 'krish', 'jack'], 

        'Age':[20, 21, 19, 18]} 

  
# Create DataFrame 

df = pd.DataFrame(data) 

  
# Print the output. 
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [ ]:

import pandas as pd 

  
# Initialize data to lists. 

data = [{'a': 1, 'b': 2, 'c':3}, 

        {'a':10, 'b': 20, 'c': 30}] 

  
# Creates DataFrame. 

df = pd.DataFrame(data) 

  
# Print the data 
df

    a   b   c
0   1   2   3
1  10  20  30